app/controllers/api/v1/games_controller.rb

INSERT INTO "games" ("score", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["score", 1100], ["created_at", "2018-11-16 00:16:06.382061"], ["updated_at", "2018-11-16 00:16:06.382061"], ["user_id", 6]]
SELECT "games".* FROM "games" WHERE "games"."user_id" = $1  [["user_id", 8]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def create
    @game = Game.create(game_params)
    User.find(@game.user_id).set_highscore