app/controllers/api/v1/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("name", "highscore", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "mike2"], ["highscore", 1100], ["created_at", "2018-11-16 00:16:06.318655"], ["updated_at", "2018-11-16 00:16:06.318655"]]