app/models/user.rb

  def set_highscore
    puts "setting hs"
    new_highscore = self.games.max{|a,b| a[:score] <=> b[:score]}.score
    self.update({highscore: new_highscore})
---
SELECT "games".* FROM "games" WHERE "games"."user_id" = $1  [["user_id", 8]]
UPDATE "users" SET "highscore" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["highscore", 30], ["updated_at", "2018-11-16 06:05:17.152749"], ["id", 8]]